
&НаКлиенте
Процедура ПереченьНоменклатурыКоличествоПриИзменении(Элемент)
    
    стч = элементы.ПереченьНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РассчитатьСумму(стч);
    
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыЦенаПриИзменении(Элемент)
    
    стч = элементы.ПереченьНоменклатуры.ТекущиеДанные;
    РаботаСДокументами.РассчитатьСумму(стч);
    
КонецПроцедуры

&НаКлиенте
Процедура ПереченьНоменклатурыНоменклатураПриИзменении(Элемент)
    
    стч = Элементы.ПереченьНоменклатуры.ТекущиеДанные;
    
    стч.Цена = РаботаСоСправочниками.РозничнаяЦена(Объект.Дата, стч.Номенклатура);
    
    РаботаСДокументами.РассчитатьСумму(стч);
    
КонецПроцедуры
